import 'package:bijoy/screen/bangobandhu_cornar/bangobandhu_cornar.dart';
import 'package:bijoy/screen/bangobandhu_cornar/screen/bangobandhu_jiboni_details.dart';
import 'package:bijoy/utill/color.dart';
import 'package:flutter/material.dart';

class BangoBandhuJiboni extends StatefulWidget {
  const BangoBandhuJiboni({Key? key}) : super(key: key);

  @override
  _BangoBandhuJiboniState createState() => _BangoBandhuJiboniState();
}

class _BangoBandhuJiboniState extends State<BangoBandhuJiboni> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: allColors.appColor,
        title: Text("বঙ্গবন্ধুর জীবনী"),
      ),
      body: Column(
        children: [
          SizedBox(height: 10,),
          Expanded(
            child: ListView.builder(
              itemCount: jiboniTitle.length,
                itemBuilder: (context,index){
                  return Padding(
                    padding: const EdgeInsets.only(left: 28.0,right: 28,top: 4,bottom: 4),
                    child: InkWell(
                      onTap: (){
                        Navigator.push(context,
                            MaterialPageRoute(
                                builder: (context)=>BangobandhuJiboniDetails(
                                    titleText: jiboniTitle[index],
                                    detailsText: jiboniDetiles[index]
                                )
                            ));
                      },
                      child: Container(
                        decoration: BoxDecoration(
                            color: allColors.appColor,
                          borderRadius: BorderRadius.only(topLeft: Radius.circular(25),topRight: Radius.circular(25))
                        ),
                        height: 50,
                        width: MediaQuery.of(context).size.width,
                        child: Center(
                          child: Text(jiboniTitle[index],
                            style: TextStyle(
                              color: Colors.white,
                              fontSize: 20
                            ),),
                        ),
                      ),
                    ),
                  );
                }
            ),
          )
        ],
      ),
    );
  }
}
AllColors allColors = AllColors();
List <String> jiboniTitle = [
"জন্ম",
  "শিক্ষা",
  "বৈবাহিক জীবন ও সন্তান",
  "রাজনৈতিক ও কর্ম জীবন",
  "রাষ্ট্রভাষা আন্দোলন",
  "৬ দফা",
  "১১ দফা দাবি ও বঙ্গবন্ধু উপাধি",
  "আগরতলা ষড়যন্ত্র মামলা",
  "৬৯’র গণঅভ্যুত্থান",
  "৭০’র নির্বাচন",
  "৭ মার্চের ভাষণ",
  "সরকার গঠন ও রাষ্ট্রপতি নির্বাচিত",
  "গ্রেফতার ও মুক্তিযুদ্ধ",
  "স্বদেশ প্রত্যাবর্তন",
  "সরকার গঠন ও বাকশাল প্রতিষ্ঠা",
  "মৃত্যু"
];
List <String> jiboniDetiles = [
"বঙ্গবন্ধু শেখ মুজিবুর রহমান ফরিদপুর জেলার গোপালগঞ্জ মহকুমার পাটগাতি ইউনিয়নের টুঙ্গিপাড়া গ্রামে ১৯২০ সালের ১৭ মার্চ জন্মগ্রহণ করেন। তার বাবা শেখ লুৎফর রহমান গোপালগঞ্জ দায়রা আদালতের সেরেস্তাদার (যিনি আদালতের হিসাব সংরক্ষণ করেন) ছিলেন। মাতা সায়েরা খাতুন। এই দম্পতির চার কন্যা এবং দুই পুত্রের সংসারে মুজিব ছিলেন তৃতীয় সন্তান। তার বড় বোন ফাতেমা বেগম, মেজ বোন আছিয়া বেগম, সেজ বোন হেলেন ও ছোট বোন লাইলী;তার ছোট ভাইয়ের নাম শেখ আবু নাসের।",
  '১৯২৭ সালে ৭ বছর বয়সে শেখ মুজিব গিমাডাঙ্গা প্রাথমিক বিদ্যালয়ে লেখাপড়া শুরু করেন। ৯ বছর বয়সে ১৯২৯ সালে গোপালগঞ্জ পাবলিক স্কুলে ভর্তি হন তিনি। এখানে ৫ বছর শিক্ষা জীবন শেষ করে ১৯৩৭ সালে গোপালগঞ্জ মাথুরানাথ ইনস্টিটিউট মিশন স্কুলে সপ্তম শ্রেনীতে ভর্তি হন মুজিব। চোখে জটিল রোগের কারণে সার্জারি কছিলেন তিনি। এ কারণে ১৯৩৪ থেকে ১৯৩৮ পর্যন্ত চার বছর তিনি বিদ্যালয়ের পাঠ চালিয়ে যেতে পারেন নি। ১৯৪১ সালে গোপালগঞ্জ মিশনারি স্কুল থেকে তিনি ম্যাট্রিক পাস করেন। ১৯৪৪ সালে কলকাতা ইসলামিয়া কলেজ থেকে এইচ.এস.সি এবং ১৯৪৬ সালে বি.এ পাশ করেন। ১৯৪৭ সালে কলকাতা ত্যাগ করে ঢাকা আগমন অতঃপর ঢাকা বিশ্ববিদ্যালয়ে "ল" ক্লাশে ভর্তি হন।',
  "১৯৩৮ সালে ১৮ বছর বয়সে বেগম ফজিলাতুন্নেসার সাথে বিয়ে বন্ধনে আবদ্ধ হন শেখ মুজিবুর রহমান। তাদের ২ মেয়ে- শেখ হাসিনা ও শেখ রেহানা এবং তিন ছেলে- শেখ কামাল, শেখ জামাল ও শেখ রাসেল।",
  "অল্পবয়স থেকেই তাঁর রাজনৈতিক প্রতিভার প্রকাশ ঘটতে থাকে। ১৯৪০ সালে তিনি নিখিল ভারত মুসলিম লীগের ছাত্র সংগঠন নিখিল ভারত মুসলিম ছাত্র ফেডারেশনে যোগ দেন। কট্টরপন্থী এই সংগঠন ছেড়ে ১৯৪৩ সালে যোগ দেন উদারপন্থী ও প্রগতিশীল সংগঠন বেঙ্গল মুসলিম লীগে। এখানেই সান্নিধ্যে আসেন হুসেইন শহীদ সোহরাওয়ার্দীর। ১৯৪৮ সালে ৪ জানুয়ারি 'পূর্ব পাকিস্তান মুসলিম ছাত্রলীগ' গঠন করেন। তিনিই ছিলেন এর অন্যতম প্রতিষ্ঠাতা । পঞ্চাশের দশক তাঁর রাজনৈতিক উত্থানের কাল। ধীরে ধীরে তিনি হয়ে উঠেন দূরদর্শীতা এক রাজনৈতিক নেতা। এসময় শেখ মুজিব “মুসলিম লীগ” ছেড়ে দেন এবং হোসেন সোহরাওয়ার্দী এবং মাওলানা ভাসানীর সাথে মিলে গঠন করেন “আওয়ামী মুসলিম লীগ”। তিনি দলের প্রথম যুগ্ম সাধারণ সম্পাদক নির্বাচিত হন। ১৯৫৩ সালে তিনি দলের সাধারণ সম্পাদকের দায়িত্ব পান। ১৯৫৪ সালের সাধারণ নির্বাচনে জয়ী হয়ে যুক্তফ্রন্ট সরকারের কৃষি মন্ত্রী হন মুজিব। ১৯৫৬ সালে কোয়ালিশন সরকারের মন্ত্রিসভায় শিল্প ও বাণিজ্য মন্ত্রণালয়ের দায়িত্ব পান তিনি। ১৯৬৩ সালে হোসেন সোহরাওয়ার্দীর মৃত্যুর পর আওয়ামী মুসলিম লীগের সভাপতি নির্বাচিত হন শেখ মুজিবুর রহমান।",
  "ভাষা আন্দোলনের সময় রাজনৈতিক নেতা হিসেবে অত্যন্ত গুরুত্বপূর্ণ ভূমিকা পালন করেন শেখ মুজিবুর রহমান। ১৯৪৮ সালে ভাষার প্রশ্নে তাঁর নেতৃত্বেই প্রথম প্রতিবাদ এবং ছাত্র ধর্মঘট শুরু হয় যা চূড়ান্ত রূপ নেয় ১৯৫২ সালের ২১ ফেব্রুয়ারিতে। যার ফলসূতিতে বাঙালি জাতি আজ বাংলা ভাষায় কথা বলছেন।",
  '১৯৬৬ সালের ৫ ফেব্রুয়ারি লাহোরে বিরোধী দলসমূহের একটি জাতীয় সম্মেলন অনুষ্ঠিত হয়। এ সম্মেলনেই শেখ মুজিব তার ঐতিহাসিক ছয় ৬ দাবী পেশ করেন যাতে পূর্ব পাকিস্তানের স্বায়ত্ত্বশাসনের পরিপূর্ণ রূপরেখা উল্লেখিত হয়েছিল। শেখ মুজিব এই দাবিকে "আমাদের বাঁচার দাবি" শিরোনামে প্রচার করেছিলেন। এ দাবি আদায়ে শেখ মুজিবের নেতৃত্বে আন্দোলন হয়েছিল।',
  "১৯৬৯ সালের ২৩ ফেব্রুয়ারি ঢাকার রেসকোর্স ময়দানে কেন্দ্রীয় ছাত্র সংগ্রাম পরিষদের উদ্যোগে শেখ মুজিবুর রহমানকে গণসম্বর্ধনা দেওয়া হয়। সেখানেই উত্থাপিত হয় ১১ দফা দাবি যার মধ্যে ৬ দফার সবগুলো দফাই অন্তর্ভুক্ত ছিল। লাখো মানুষের এই জমায়েতে শেখ মুজিবুর রহমানকে ‘বঙ্গবন্ধু’ উপাধিতে ভূষিত করা হয়।",
  "১৯৬৮ সালের প্রথমদিকে পাকিস্তান সরকার শেখ মুজিব এবং আরও ৩৪ জন বাঙালি সামরিক ও সিএসপি কর্মকর্তার বিরুদ্ধে একটি মামলা দায়ের করে যা ইতিহাসে আগরতলা ষড়যন্ত্র মামলা নামে সুপরিচিত। মামলায় উল্লেখ করা হয়েছিল শেখ মুজিবসহ এই কর্মকর্তারা ভারতের ত্রিপুরা অঙ্গরাজ্যের অন্তর্গত আগরতলা শহরে ভারত সরকারের সাথে এক বৈঠকে পাকিস্তানকে বিভক্ত করার ষড়যন্ত্রমূলক পরিকল্পনা তৈরি করেছে। এতে শেখ মুজিবকে এক নম্বর আসামী করা হয়।",
  "১৯৬৯ সালের ৫ ডিসেম্বর আয়োজিত এক জনসভায় বঙ্গবন্ধু শেখ মুজিব পূর্ব বাংলার নামকরণ করেন ‘বাংলাদেশ’। তিনি বলেন, “একসময় এদেশের বুক হইতে, মানচিত্রের পৃষ্ঠা হইতে ‘বাংলা’ কথাটির সর্বশেষ চিহ্নটুকুও চিরতরে মুছিয়া ফেলার চেষ্টা করা হইয়াছে। একমাত্র ‘বঙ্গোপসাগর’ছাড়া আর কোন কিছুর নামের সঙ্গে ‘বাংলা’ কথাটির অস্তিত্ব খুঁজিয়া পাওয়া যায় নাই। জনগণের পক্ষ হইতে আমি ঘোষণা করিতেছি- আজ হইতে পাকিস্তানের পূর্বাঞ্চলীয় প্রদেশটির নাম পূর্ব পাকিস্তানের পরিবর্তে শুধুমাত্র বাংলাদেশ”। ",
  "১৯৭০ সালের ৭ ডিসেম্বরে সাধারণ নির্বাচনে শেখ মুজিবুর রহমানের নেতৃত্বে আওয়ামী লীগ প্রাদেশিক আইনসভায় নিরঙ্কুশ সংখ্যাগরিষ্ঠতা অর্জন করে। আওয়ামী লীগ তৎকালীন পূর্ব পাকিস্তানে জাতীয় পরিষদের ১৬৯টি আসনের মধ্যে ১৬৭টি আসন এবং প্রাদেশিক পরিষদের ৩১০টি আসনের মধ্যে ৩০৫টি আসন লাভ করে। কিন্তু পশ্চিম পাকিস্তানি শাসকগোষ্ঠী মুজিবের স্বায়ত্বশাসনের নীতির পুরোপুরি বিপক্ষে ছিলো। আওয়ামী লীগের সরকার গঠন ঠেকাতে প্রেসিডেন্ট ইয়াহিয়া খান সংসদের অধিবেশন ডাকা নিয়ে টালবাহানা শুরু করেন। শেখ মুজিব তখনই বুঝে যান যে, পশ্চিম পাকিস্তানি শাসকদের দুঃশাসনের অবসান ঘটাতে লড়াইয়ের কোনো বিকল্প নেই।",
  "১৯৭১ সালের ৭ই মার্চ রেসকোর্স ময়দানে এক ঐতিহাসিক ভাষণে বঙ্গবন্ধু শেখ মুজিবুর রহমান স্বাধীনতার ডাক দেন। রেসকোর্সের জনসমুদ্রে বঙ্গবন্ধু ঘোষণা করেন “এবারের সংগ্রাম আমাদের মুক্তির সংগ্রাম, এবারের সংগ্রাম স্বাধীনতার সংগ্রাম”। ঐতিহাসিক এ ভাষণে জাতির জনক বঙ্গবন্ধু বাঙালি জাতিকে শৃংখল মুক্তির আহ্বান জানিয়ে ঘোষণা করেন, “রক্ত যখন দিয়েছি, রক্ত আরো দেবো। এদেশের মানুষকে মুক্ত করে ছাড়বো ইনশাল্লাহ্।  প্রত্যেকে ঘরে ঘরে দূর্গ গড়ে তোলো। যার যা কিছু আছে তাই নিয়েই শত্রুর মোকাবিলা করতে হবে”।",
  "১৯৭১ সালের ১৭ই এপ্রিল গণপ্রজাতন্ত্রী বাংলাদেশের প্রথম সরকার গঠিত হয় এবং শেখ মুজিবকে রাষ্ট্রপতি করা হয়। তাঁর অনুপস্থিতিতে অস্থায়ী রাষ্ট্রপতির দায়িত্ব পালন করেন সৈয়দ নজরুল ইসলাম। এ সরকারের অধীনেই গঠিত হয় মুক্তিবাহিনী এবং শুরু হয় পাক সেনাদের প্রতিহত করার পালা।",
  "বঙ্গবন্ধুর ডাকে উত্তাল হয়ে ওঠে সারা বাংলা। মুজিবের নেতৃত্বে বাঙ্গালি জাতির এই জাগরণে ভীত ইয়াহিয়া খান সামরিক আইন জারি করেন, নিষিদ্ধ করেন আওয়ামী লীগকে এবং শেখ মুজিবকে গ্রেপ্তারের নির্দেশ দেন। এরপর ১৯৭১ সালের ২৫ মার্চরাতের অন্ধকারে নিরীহ নিরস্ত্র বাঙালির ওপর হায়েনার মতো ঝাঁপিয়ে পড়ে পাকিস্তানি সেনারা; শুরু করে অপারেশন সার্চলাইট নামে ইতিহাসের জঘন্যতম হত্যাকাণ্ড।অশীতিপর বৃদ্ধ থেকে কোলের শিশু- কেউ রক্ষা পায়না পাক হায়েনাদের নারকীয়তা থেকে। ১৯৭১ সালে ২৫ মার্চ পাক বাহিনী কতৃক ধানমন্ডিস্থ স্বীয় বাসভবন থেকে পাকিস্থান সামরিক বাহিনীর হাতে গ্রেফতার হন বঙ্গবন্ধ শেখ মুজিবুর রহমান। দীর্ঘ নয় মাসের রক্তক্ষয়ী লড়াইয়ের পর, ৩০ লক্ষ বাঙ্গালীর প্রাণের বিনিময়ে অবশেষে আসে বিজয়। ১৬ ডিসেম্বর সেই সোহরাওয়ার্দী উদ্যান যেখান থেকে স্বাধীনতা সংগ্রামের ডাক দিয়েছিলেন বঙ্গবন্ধু, সেখানেই বাংলাদেশ-ভারত মিত্রবাহিনীর কাছে আত্মসমর্পন করে পাকিস্তানী সেনাবাহিনী। পৃথিবীর মানচিত্রে জন্ম নেয় বাংলাদেশ নামের নতুন একটি দেশ।",
  "১৯৭২ সালের ১০ জানুয়ারি বঙ্গবন্ধু ফিরে আসেন তাঁর প্রিয় মাতৃভূমি বাংলায়। দেশে ফিরেই যুদ্ধ বিধ্বস্ত দেশ পুনর্গঠনে ঝাঁপিয়ে পড়েন বঙ্গবন্ধু। মানবিক বিপর্যয় মোকাবিলায় আন্তর্জাতিক সাহায্যের আবেদন জানান তিনি। ",
  "১২ জানুয়ারি বাংলাদেশ সরকারের প্রধানমন্ত্রীর দায়িত্ব গ্রহণ করেন তার শাসনামলে বিশ্বের ১০৪টি দেশ বাংলাদেশকে স্বীকৃতি প্রদান করে। তিনি বিশ্ব শান্তি পরিষদ প্রদত্ত জুলিও কুরি পদক লাভ করেন। তার নেতৃত্বে দেশে সংসদীয় পদ্ধতির সরকারের পরিবর্তে একদলীয় রাষ্ট্রপতি পদ্ধতির সরকার প্রতিষ্ঠিত হয়। এরই মধ্যে সক্রিয় হয়ে ওঠে স্বাধীনতাবিরোধী একটি চক্র। মুক্তিযুদ্ধের বিরোধীতাকারী দেশীয় ও আন্তর্জাতিক চক্রের প্রত্যক্ষ ইন্ধনে রাজনৈতিক অস্থিতশীলতা সৃষ্টি করতে উঠেপড়ে লাগে এই চক্রটি। এসময় বঙ্গবন্ধু বুঝতে পারেন, রাজনৈতিক স্থিতিশীলতা ছাড়া দেশের উন্নয়ন সম্ভব নয়। ১৯৭৪ সালে তিনি সকল রাজনৈতিক দলকে এক ছাতার নীচে আনতে প্রতিষ্ঠা করেন বাংলাদেশ কৃষক শ্রমিক আওয়ামী লীগ বা ‘বাকশাল'। একই সাথে অন্যান্য সকল রাজনৈতিক দলকে নিষিদ্ধ করা হয়। উল্লেখ্য, প্রথম যে দলটি নিষিদ্ধ করা হয় তার নাম বাংলাদেশ আওয়ামী লীগ। এটা শেখ মুজিবুর রহমানের নিজের দল ।",
  "১৯৭৫ সালের ১৫ আগস্ট মধ্যরাতে একদল বিপথগামী সেনা কর্মকর্তা হত্যা করে বঙ্গবন্ধু শেখ মুজিবর রহমানকে এবং তাঁর পরিবারের সদস্যদের। কেবল তাঁর দুই মেয়ে শেখ হাসিনা ও শেখ রেহানা সেই সময়ে দেশের বাইরে থাকায় বেঁচে যান। সদ্য স্বাধীন হওয়া বাঙালি জাতির জীবনে এক অপূরণীয় ক্ষতি নিয়ে আসে এই জঘন্য হত্যাকাণ্ড। দেশে তৈরি হয় রাজনৈতিক শূণ্যতা, ব্যাহত হয় গণতান্ত্রিক উন্নয়নের ধারা। বঙ্গবন্ধুকে হত্যা করে বাঙালি জাতির যে ক্ষতি হয়েছে তা কখনো পূরণীয় নয়। "
];
