import 'package:bijoy/model/book_model.dart';

class BookRipo{
  List <BookModel> allBookModel = [
    BookModel("assets/image/book1.jpg", "নাম : অসমাপ্ত আত্মজীবনী", "প্রকাশকালঃ জুন ২০১২", "সম্পাদনাঃ দি ইউনিভার্সিটি প্রেস লিমিটেড", "শেখ মুজিবুর রহমান ১৯৫৪ খ্রিষ্টাব্দ পর্যন্ত নিজের জীবনী লিখেছেন। এই গ্রন্থটি ইংরেজিসহ আরও কয়েকটি ভাষায় অনূদিত হয়।"),
    BookModel("assets/image/book2.jpg", "নাম : কারাগারের রোজনামচা", "প্রকাশকালঃ মার্চ ২০১৭", "সম্পাদনাঃ বাংলা একাডেমি", "গ্রন্থটি ১৯৬৬ খ্রিষ্টাব্দে শেখ মুজিবুর রহমানের কারাভোগের দিনলিপি। গ্রন্থটির নামকরণ করেন তার কনিষ্ঠা কন্যা শেখ রেহানা।"),
    BookModel("assets/image/book3.jpg", "নাম : আমার দেখা নয়াচীন", "প্রকাশকালঃ ফেব্রুয়ারি ২০২০", "সম্পাদনাঃ বাংলা একাডেমি", "১৯৫২ খ্রিষ্টাব্দের অক্টোবরে গণচীনের পিকিংয়ে অনুষ্ঠিত এশীয় ও প্রশান্ত মহাসাগরীয় শান্তি সম্মেলন উপলক্ষে শেখ মুজিবের চীন ভ্রমণের অভিজ্ঞতা নিয়ে রচিত।"),
  ];
}