
import 'package:bijoy/model/quiz_model.dart';

class QuizRepo{

  List<QuestionModel> getQuestionModelList=[
    QuestionModel
      (
        "মুক্তিযুদ্ধে অবদানের জন্য বীরশ্ৰেষ্ঠ উপাধি পেয়েছেন-",
        [ "৯ জন","৭ জন","১০ জন","১২ জন"],
        [0,1,0,0]
    ),
    QuestionModel
      (
        "নিচের কোনটি মুক্তিযুদ্ধ বিষয়ক চলচ্চিত্র ?",
        [ "তিতাস একটি নদীর নাম ","শ্রাবণ মেঘের দিন ","সিপাহী","নদীর নাম মধুমতি "],
        [0,0,0,1]
    ),
    QuestionModel
      (
      "বীর প্রতীক খেতাবপ্রাপ্ত একমাত্র বিদেশী মুক্তিযোদ্ধা-",
      ["মার্কটালী","আন্দ্রে মারলো","ডব্লিও এ.এস ওডারল্যান্ড","এডওয়ার্ড কেনেডি"],
      [0,0,1,0]
    ),
    QuestionModel(
        "১ আগস্ট ১৯৭১ ‘দ্য কনসার্ট ফর বাংলাদেশ’ অনুষ্ঠিত হয়?",
        ["প্যারিসে","নিউইয়র্কে","ওউয়াশিংটনে","লন্ডনে"],
        [0,1,0,0]
    ),
    QuestionModel(
        "মুক্তিযুদ্ধের প্রধান সেনাপতি জেনারেল এম এ জি ওসমানীর বাড়ী কোন জেলায়?",
        ["রাঙামাটি","সিলেট","রাজশাহী","কুমিল্লা"],
        [0,1,0,0]
    ),
    QuestionModel(
        "আমার ভাইয়ের রক্তে রাঙানো গানটির গীতিকার কে?",
        ["গোবিন্দ হালদার","আলতাফ মাহমুদ ","গাফফার চৌধুরী ","এদের কেউ নয় "],
        [0,0,1,0]
    ),
    QuestionModel(
        "স্বাধীন বাংলাদেশের প্রথম রাষ্ট্রপতি কে?",
        ["শেরে বাংলা এ কে ফজলুল হক ","শহীদ জিয়াউর রহমান ","বঙ্গবন্ধু শেখ মুজিবুর রহমান","মতিউর রহমান"],
        [0,0,1,0]
    ),
    QuestionModel(
        "বীরশ্রেষ্ঠ রুহুল আমীন কোথায় কাজ/চাকরি করতেন?",
        ["নৌ-বাহিনী","সেনাবাহিনী","বিমান বাহিনী","কোনটিই নয় "],
        [1,0,0,0]
    ),
    QuestionModel(
        "১৯৫২ সালের ২১ ফেব্রুয়ারী বাংলা সাল কত ছিল?",
        ["১৩৫৮ ","১৩৫৯","১৩৭০","১৩৭১ "],
        [1,0,0,0]
    ),
    QuestionModel(
        "অপারেশন সার্চ লাইট কোন সালের ঘটনা?",
        ["১৯৬৯","১৯৭১ ","১৯৭৫","১৯৯০"],
        [0,1,0,0]
    ),
    QuestionModel(
        "বাংলাদেশের মুক্তিযুদ্ধের অবদানের জন্য বীর বিক্রম উপাধি লাভ করেন-",
        ["১৭৫ জন","১৮৫ জন","১৯৫ জন","২০৫ জন"],
        [1,0,0,0]
    ),
    QuestionModel(
        "বাংলাদেশকে স্বীকৃতিদানকারী প্রথম আফ্রিকার দেশ কোনটি?",
        ["মরিশাস","সেনেগাল","গাম্বিয়া","সোয়াজিল্যান্ড"],
        [0,0,0,1]
    ),
    QuestionModel(
        "ভাষা আন্দোলনের প্রথম সংকলন ‘একুশে ফেব্রুয়ারি' গ্রন্থের সম্পাদক কে ছিলেন?",
        ["শামসুর রহমান","সৈয়দ শামসুল হক","হাসান হাফিজুর রহমান","আবু জাফর ওবায়দুল্লাহ"],
        [0,0,1,0]
    ),
    QuestionModel(
        "নিচের কোনটি মুক্তিযুদ্ধের ১নং সেক্টর ছিল?",
        ["ঢাকা ","চট্টগ্রাম ","রাজশাহী ","সিলেট "],
        [0,1,0,0]
    ),
    QuestionModel(
        "কোন সময় মুজিবনগরে স্বাধীন বাংলাদেশের অস্থায়ী সরকার গঠিত হয়?",
        ["৭ই মার্চ ১৯৭১","২৬শে মার্চ ১৯৭১","১৭ই এপ্রিল ১৯৭১(শপথ গ্রহণ","১৭ই জুন ১৯৭১"],
        [0,0,1,0]
    )
  ];
}