import 'package:bijoy/helper/castom_appbar.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class IndependantWarWithTime extends StatefulWidget {
  const IndependantWarWithTime({Key? key}) : super(key: key);

  @override
  _IndependantWarWithTimeState createState() => _IndependantWarWithTimeState();
}

class _IndependantWarWithTimeState extends State<IndependantWarWithTime> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: PreferredSize(
          preferredSize: Size.fromHeight(60),
          child: CustomAppBar(titile: 'স্বাধীনতা যুদ্ধ')
      ),
      body: SingleChildScrollView(
        scrollDirection: Axis.vertical,
        child: Column(
          children: [
            Center(child: Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text("মার্চ থেকে জুন",
              style: TextStyle(
                fontSize: 30,
                fontWeight: FontWeight.bold
              ),),
            )),
            Padding(
              padding: const EdgeInsets.all(15.0),
              child: Text("মার্চের শেষদিক থেকেই পাকিস্তানি সামরিক বাহিনী বাংলাদেশের গ্রামে-গঞ্জে ছড়িয়ে পড়তে শুরু করে। আওয়ামী লীগের কর্মী-সমর্থক এবং হিন্দু ধর্মাবলম্বীরা বিশেষভাবে তাদের রোষের শিকার হয়। দলে দলে মানুষ ভারত সীমান্তের দিকে পালাতে শুরু করে। এপ্রিল থেকে শুরু হওয়া শরণার্থীদের এই স্রোত নভেম্বর পর্যন্ত অব্যাহত ছিল এবং এ সময়ে প্রায় এক কোটি শরণার্থী ভারতে আশ্রয় গ্রহণ করে। \n \nঢাকায় গণহত্যা চালানোর পর পাকিস্তানি বাহিনী ১০ এপ্রিলের মধ্যে সারা বাংলাদেশ নিজেদের আয়ত্তে আনার পরিকল্পনা করে। কিন্তু সামরিক বাহিনীর বাঙালি সদস্যরা এবং ছাত্র ও সাধারণ জনতা তাদের বিরুদ্ধে তীব্র প্রতিরোধ গড়ে তোলে। চট্টগ্রামে বাঙালি সেনাবাহিনীর সদস্য ও ইপিআর এর সদস্যরা বিদ্রোহ করে শহরের বড়ো অংশ নিয়ন্ত্রণে নিয়ে নেয়। চট্টগ্রাম শহরের নিয়ন্ত্রণ পেতে পাকিস্তানি বাহিনীকে যুদ্ধজাহাজ থেকে গোলাবর্ষণ করতে হয় এবং বিমান আক্রমণ চালাতে হয়। কুষ্টিয়া, পাবনা, বগুড়া, দিনাজপুর ইত্যাদি জেলাতেও বাঙালি সেনারা বিদ্রোহ করে নিয়ন্ত্রণ গ্রহণ করে। পরবর্তীতে পাকিস্তানিরা বিপুলসংখ্যক সৈন্য ও অস্ত্রশস্ত্রের বলে মে মাসের শেষ নাগাদ এসব মুক্তাঞ্চল দখল করে নেয়। \n \n১৯৭১ সালের ১৭ এপ্রিল মুক্তিযুদ্ধ পরিচালনার জন্য অস্থায়ী বাংলাদেশ সরকারের আনুষ্ঠানিক প্রতিষ্ঠা হয় কুষ্টিয়া জেলার মেহেরপুর মহকুমা (বর্তমানে জেলা) বৈদ্যনাথতলার অন্তর্গত ভবেরপাড়া (বর্তমান মুজিবনগর) গ্রামে। শেখ মুজিবুর রহমান-এর অনুপস্থিতিতে তাকে রাষ্ট্রপতি করে সরকার গঠন করা হয়। অস্থায়ী রাষ্ট্রপতির দায়িত্ব নেন সৈয়দ নজরুল ইসলাম এবং প্রধানমন্ত্রীর দায়িত্ব অর্পিত হয় তাজউদ্দিন আহমদের ওপর। বাংলাদেশের প্রথম সরকার দেশি-বিদেশি সাংবাদিকের সামনে শপথ গ্রহণ করে আনুষ্ঠানিকভাবে দায়িত্ব পালন শুরু করে। এই শপথ গ্রহণ অনুষ্ঠানে স্বাধীনতার ঘোষণাপত্র পাঠের মাধ্যমে ২৬ মার্চ থেকে বাংলাদেশকে আনুষ্ঠানিকভাবে স্বাধীন সার্বভৌম রাষ্ট্র হিসেবে ঘোষণা করা হয়। \n \nস্বাধীনতা যুদ্ধে গেরিলাদের প্রথম পর্যায়ের যুদ্ধগুলো ছিল পরিকল্পনাহীন ও অপ্রস্তুত। ২৬ মার্চ সারা দেশে প্রতিরোধ শুরু হয় এবং এপ্রিলের শুরুতেই প্রবাসী সরকার গঠিত হয়। কিন্তু অস্ত্রপ্রাপ্তি ও প্রশিক্ষণ - এই দুইয়ের ঘাটতির কারণে বাংলাদেশের স্বাধীনতার লড়াই পরিকল্পিত রূপ পেতে পেতে জুন মাস পার হয়ে যায়। ",
              style: TextStyle(
                fontSize: 20
              ),),
            ),
            Center(child: Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text("জুলাই থেকে সেপ্টেম্বর",
                style: TextStyle(
                    fontSize: 30,
                    fontWeight: FontWeight.bold
                ),),
            )),
            Padding(
              padding: const EdgeInsets.all(15.0),
              child: Text("১১ জুলাই বাংলাদেশের সামরিক কমান্ড তৈরি করা হয়। কর্নেল (অবঃ) মুহম্মদ আতাউল গণি ওসমানীকে বাংলাদেশ বাহিনীর সৰ্বাধিনায়ক করা হয়। লে. জেনারেল খাজা ওয়াসিউদ্দিন বাঙালিদের মধ্যে জ্যেষ্ঠ সামরিক কর্মকর্তা হলেও পশ্চিম পাকিস্তানে অবস্থান করায় তার পক্ষে যুদ্ধে যোগ দেওয়া সম্ভব হয় নি। বাংলাদেশকে সর্বমোট ১১টি সেক্টরে ভাগ করা হয় এবং পাকিস্তানি সেনাবাহিনী থেকে পালিয়ে আসা কর্মকর্তাদের মধ্য থেকে প্রতিটি সেক্টরের জন্যে একজন করে অধিনায়ক নির্বাচন করা হয়। \n \nআগস্টের পরপরই বিপুল সংখ্যক মুক্তিযোদ্ধা গেরিলা পদ্ধতিতে বাংলাদেশের বিভিন্ন স্থানে পাকিস্তানি সামরিক বাহিনী ও তাদের সহায়তাকারীদের ওপর আক্রমণ চালাতে থাকে। পাকিস্তানি সামরিক ঘাঁটি থেকে শুরু করে সামরিক স্থাপনা, যোগাযোগ বিচ্ছিন্ন করার লক্ষ্যে রাস্তাঘাট, সেতু, কালভার্ট ইত্যাদি মুক্তিযোদ্ধাদের লক্ষ্যবস্তুতে পরিণত হয়। গেরিলা হামলায় স্বল্পপ্রশিক্ষিত গেরিলা যোদ্ধারা পাকিস্তানি সামরিক বাহিনীকে নাজেহাল করে তোলে। রাজধানী ঢাকাতেও ক্র্যাক প্লাটুন বেশ কয়েকটি দুঃসাহসী অভিযান চালায়। ১৯৭১ সালের ১৬ আগস্ট মুক্তিবাহিনীর নৌ-কমান্ডোরা অপারেশন জ্যাকপটের মাধ্যমে চট্টগ্রাম বন্দরে নোঙ্গর করে থাকা পাকিস্তানি যুদ্ধজাহাজগুলো মাইন দিয়ে ধ্বংস করে দেয়। ধীরে ধীরে বাংলাদেশের বিভিন্ন অঞ্চল শত্রুমুক্ত হতে শুরু করে। \n \nআগস্ট মাস থেকেই পাকিস্তানি বাহিনীর বিরুদ্ধে নৌ-আক্রমণ শুরু হয়, যাঅপারেশন জ্যাকপট নামে পরিচিত।",
                style: TextStyle(
                    fontSize: 20
                ),),
            ),
            Center(child: Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text("অক্টোবর থেকে ডিসেম্বর",
                style: TextStyle(
                    fontSize: 30,
                    fontWeight: FontWeight.bold
                ),),
            )),
            Padding(
              padding: const EdgeInsets.all(15.0),
              child: Text("মুক্তিবাহিনী তীব্র আক্রমণের মাধ্যমে সীমান্তবর্তী পাকিস্তানি বাহিনীর সীমান্ত ঘাঁটিগুলো একে একে দখল করে নিতে শুরু করে। বাংলাদেশের নিয়মিত বাহিনী কমলপুর, বিলোনিয়া, বয়রা প্রভৃতি সীমান্ত ঘাঁটি আক্রমণ করে এবং ৩০৭টি ঘাঁটির প্রায় এক-তৃতীয়াংশ সংখ্যক ঘাঁটি (৯০টি) দখল করে নেয়। পাশাপাশি গেরিলা বাহিনীর আক্রমণও তীব্রতর হয়ে ওঠে। পাকিস্তানি বাহিনী ও তাদের সহযোগী রাজাকার বাহিনীর নিয়মিত কাজ ছিল সাধারণ মানুষের ওপর অত্যাচার করা এবং বাঙালিদের ওপর নির্যাতন করা। সীমান্তে ও দেশের অভ্যন্তরে মুক্তিযোদ্ধাদের প্রচণ্ড আক্রমণের জবাবে তারা এ অত্যাচারের মাত্রা আরো বাড়িয়ে দেয়। কিন্তু অক্টোবরের শেষের দিকে মুক্তিবাহিনীর প্রবল প্রতিরোধের সম্মুখীন হয়ে তারা দিনের বেলাতেও নিজেদের সামরিক ঘাঁটি থেকে বের হতে ভয় পেত। তখন পশ্চিম পাকিস্তান থেকে জরুরি ভিত্তিতে ৫ ব্যাটালিয়ন অতিরিক্ত সৈন্য আনা হয়।",
                style: TextStyle(
                    fontSize: 20
                ),),
            ),
          ],
        ),
      ),
    );
  }
}
