import 'package:bijoy/helper/castom_appbar.dart';
import 'package:bijoy/screen/independant/response_details.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class InterNationalResponse extends StatefulWidget {
  const InterNationalResponse({Key? key}) : super(key: key);

  @override
  _InterNationalResponseState createState() => _InterNationalResponseState();
}

class _InterNationalResponseState extends State<InterNationalResponse> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: PreferredSize(
          preferredSize: Size.fromHeight(60),
          child: CustomAppBar(titile: 'আন্তর্জাতিক প্রতিক্রিয়া')
      ),
      body: Padding(
        padding: const EdgeInsets.all(18.0),
        child: Column(
          children: [
            Expanded(
              child: ListView.builder(
                  itemCount: countryName.length,
                  itemBuilder: (context,index){
                    return Padding(
                      padding: const EdgeInsets.all(8.0),
                      child: SizedBox(
                        height: 40,
                        child: ElevatedButton(
                          child: Text(countryName[index],
                            style: TextStyle(
                                fontSize: 20
                            ),
                          ),
                          style: ElevatedButton.styleFrom(
                              primary: Colors.teal
                          ),
                          onPressed: (){
                            Navigator.push(context,
                                MaterialPageRoute(builder: (context)=>ResponseDetails(
                                    intCountryName: countryName[index],
                                    intCountryResponse: countryResponse[index])));
                          },
                        ),
                      ),
                    );
                  }),
            )
          ],
        ),
      ),
    );
  }
}
List <String> countryName = [
"জাতিসংঘ",
"ভারত",
"ভুটান",
"যুক্তরাষ্ট্র ও সোভিয়েত ইউনিয়ন",
"চীন",
"শ্রীলঙ্কা",
"আরব বিশ্ব",
"ইরান"
];
List <String> countryResponse = [
"পূর্ব পাকিস্তানের সংকটের বিষয়ে জাতিসংঘের অবহেলা ও নিস্পৃহতা ব্যাপকভাবে সমালোচিত হয়। ৪ ডিসেম্বর ওয়াশিংটনে হেনরি কিসিঞ্জার নিরাপত্তা পরিষদের আহূত অধিবেশনে যুদ্ধবিরতি ও সৈন্য প্রত্যাহারের দাবি সংবলিত মার্কিন প্রস্তাব পেশ করার প্রস্তুতি নেন। মার্কিন পররাষ্ট্র দফতর এক বিবৃতিতে উপমহাদেশের সংঘাতের জন্য মুখ্যত ভারতকে দায়ী করে। নিরাপত্তা পরিষদের অধিবেশন শুরু হওয়ার পর মার্কিন প্রতিনিধি জর্জ এইচ ডব্লিউ বুশ অবিলম্বে যুদ্ধবিরতি ঘোষণা, ভারত ও পাকিস্তানের সৈন্য স্ব স্ব সীমান্তের ভিতরে ফিরিয়ে নেওয়া এবং সেই সিদ্ধান্ত কার্যকর করার উদ্দেশ্যে জাতিসংঘ মহাসচিবকে ক্ষমতা প্রদান করার জন্য এক প্রস্তাব উত্থাপন করেন। সোভিয়েত প্রতিনিধি এই প্রস্তাবকে ‘একতরফা’ বলে অভিহিত করে ভেটো প্রয়োগ করেন। পোল্যান্ডও প্রস্তাবের বিপক্ষে ভোট দেয়। ফ্রান্স ও ব্রিটেন ভোট দানে বিরত থাকে। পরদিন ৫ ডিসেম্বরে নিরাপত্তা পরিষদের পুনরায় যে অধিবেশন বসে তাতে সোভিয়েত ইউনিয়নের এক প্রস্তাবে বলা হয় পূর্ব পাকিস্তানে এমন এক ‘রাজনৈতিক নিষ্পত্তি’ প্রয়োজন যার ফলে বর্তমান সংঘর্ষের অবসান নিশ্চিতভাবেই ঘটবে এবং পাকিস্তানি বাহিনীর যে সহিংসতার দরুন পরিস্থিতির অবনতি ঘটেছে তাও অবলিম্বে বন্ধ করা প্রয়োজন। একমাত্র পোল্যান্ড প্রস্তাবটি সমর্থন করে। চীন ভোট দেয় বিপক্ষে। অন্য সকল সদস্য ভোটদানে বিরত থাকে। ওই দিন আরো আটটি দেশের পক্ষ থেকে যুদ্ধবিরতি ও সৈন্য প্রত্যাহারের পক্ষে নিরাপত্তা পরিষদে আর একটি প্রস্তাব উত্থাপিত হয়। এবার সোভিয়েত ইউনিয়ন দ্বিতীয়বার ভেটো প্রয়োগ করে। একই সময়ে ‘তাস’ মারফত এক বিবৃতিতে সোভিয়েত সরকার ‘পূর্ব বাংলার জনগণের আইনসঙ্গত অধিকার ও স্বার্থের স্বীকৃতির ভিত্তিতে’ সঙ্কটের রাজনৈতিক সমাধানের দাবি জানায়, এই সংঘর্ষ সোভিয়েত সীমান্তের সন্নিকটে সংঘটিত হওয়ায় ‘এর সঙ্গে সোভিয়েত নিরাপত্তার প্রশ্ন জড়িত' বলে উল্লেখ করে এবং পরিস্থিতির অবনতি রোধকল্পে বিবদমান পক্ষদ্বয়ের যে কোনোটির সঙ্গে জড়িত হওয়া থেকে বিরত থাকার জন্য বিশ্বের সকল দেশের প্রতি আহ্বান জানায়।",
'বাংলাদেশের স্বাধীনতা যুদ্ধে প্রতিবেশী রাষ্ট্র হিসেবে ভারতের বিস্তৃত অবদান রয়েছে। শরণার্থীদের আশ্রয় দান, প্রবাসী সরকারের গঠনে সহায়তা এবং সর্বোপরি মুক্তিবাহিনীর সংগঠন, প্রশিক্ষণ ও সমরাস্ত্র সরবরাহে ভারতের ভূমিকা ছিল প্রত্যক্ষ। ভারত সরাসরি সামরিক হস্তক্ষেপ করে যার ফলে এই যুদ্ধের সময় কমে আসে এবং যুদ্ধের ফলাফল বাংলাদেশের পক্ষে তরান্বিত হয়। \n \nঅনেক বিশ্লেষকের মতে ১৯৪৭ সালের পর থেকেই পূর্ব বঙ্গ ও কাশ্মীর এই দুই অঞ্চলে প্রভাব বিস্তার নিয়ে ভারত ও পাকিস্তানের মধ্যে ভূরাজনৈতিক দ্বন্দ্ব ছিল, যার চূড়ান্ত ফলশ্রূতি হিসেবে বাংলাদেশের স্বাধীনতা যুদ্ধে ভারত পূর্ব বাংলাকে পাকিস্তানের নিয়ন্ত্রণ থেকে মুক্ত করার উদ্দেশ্যে প্রত্যক্ষভাবে সহায়তা করে। \n \nদক্ষিণ এশিয়ায় ভুটানের পরপরই ৬ ডিসেম্বর ১৯৭১ বাংলাদেশকে স্বাধীন ও সার্বভৌম রাষ্ট্র হিসেবে আনুষ্ঠানিকভাবে স্বীকৃতি দান করে। প্রথমে ভুটানের স্বীকৃতির কয়েক ঘণ্টা পরে তারবার্তার মাধ্যমে ভারত বাংলাদেশকে দ্বিতীয় স্বীকৃতি প্রদান করে। ৬ ডিসেম্বরে ভারত সরকারের পক্ষ থেকে আনুষ্ঠানিকভাবে জানানো হয় বাংলাদেশ সম্পর্কে কূটনৈতিক স্বীকৃতি। “বেলা এগারোটার সময় ‘অল ইন্ডিয়া রেডিয়ো’ মারফত ঘোষণা করা হয় যে ভারত বাংলাদেশকে সার্বভৌম রাষ্ট্র বলে স্বীকৃতি দিয়েছে। ভারতের পার্লামেন্টের বিশেষ অধিবেশনে গণপ্রজাতন্ত্রী বাংলাদেশকে স্বীকৃতি প্রদানের প্রস্তাব উত্থাপন করে ইন্দিরা গান্ধী বলেন, “বাংলাদেশের সব মানুষের ঐক্যবদ্ধ বিদ্রোহ এবং সেই সংগ্রামের সাফল্য এটা ক্রমান্বয়ে স্পষ্ট করে তুলেছে যে, তথাকথিত মাতৃরাষ্ট্র পাকিস্তান বাংলাদেশের মানুষকে স্বীয় নিয়ন্ত্রণে ফিরিয়ে আনতে সম্পূর্ণ অসমর্থ। বাংলাদেশ সরকারের বৈধতা সম্পর্কে বলা যায়, গোটা বিশ্ব এখন সচেতন যে, তারা জনগণের বিপুল সংখ্যাগরিষ্ঠ অংশের আকাঙ্ক্ষার প্রতিফলন ঘটায়, জনগণকে প্রতিনিধিত্বকারী অনেক সরকারই যেমনটা দাবি করতে পারবেনা। গভর্নর মরিসের প্রতি জেফারসনের বহু খ্যাত উক্তি অনুসারে বাংলাদেশের সরকার সমর্থিত হচ্ছে ‘পরিপূর্ণভাবে প্রকাশিত জাতির আকাঙ্ক্ষা বা উইল অব দ্য নেশন’ দ্বারা। এই বিচারে পাকিস্তানের সামরিক সরকার, যাদের তোষণ করতে অনেক দেশই বিশেষ উদগ্রীব, এমনকি পশ্চিম পাকিস্তানের জনগণেরও প্রতিনিধিত্ব করেনা।”\n \n৪ ডিসেম্বর আনুষ্ঠানিক স্বীকৃতির জন্য বাংলাদেশের অস্থায়ী রাষ্ট্রপতি সৈয়দ নজরুল ইসলাম ও প্রধানমন্ত্রী তাজউদ্দীন আহমদ যুগ্মভাবে ভারতের প্রধানমন্ত্রী ইন্দিরা গান্ধীকে অনুরোধ জানিয়ে একটি পত্র প্রেরণ করেন। বাংলাদেশ সরকারের ৪ ডিসেম্বরের পত্রের জবাবে ইন্দিরা গান্ধী বাংলাদেশের প্রধানমন্ত্রী তাজউদ্দীন আহমদকে বাংলাদেশকে স্বীকৃতি প্রদানের বিষয়ে যে পত্র প্রেরণ করেন তার আংশিক বঙ্গানুবাদ নিম্নরূপ: \n \n"সত্যের জয় হোক প্রধানমন্ত্রী নয়াদিল্লি ডিসেম্বর ৬, ১৯৭১ প্রিয় প্রধানমন্ত্রী, মহামান্য অস্থায়ী রাষ্ট্রপতি সৈয়দ নজরুল ইসলাম ও আপনি ৪ ডিসেম্বর আমাকে যে বাণী প্রেরণ করেছেন তাতে আমি ও ভারত সরকারে আমার সহকর্মীবৃন্দ গভীরভাবে অভিভূত হয়েছি। এই পত্র পাওয়ার পর আপনার বিচক্ষণ নেতৃত্বে পরিচালিত গণপ্রজাতন্ত্রী বাংলাদেশ সরকারের প্রতি স্বীকৃতি প্রদানের অনুরোধ ভারত সরকার পুনরায় বিবেচনা করেছে। আমি সানন্দে জানাই যে, বর্তমানে বিরাজিত পরিস্থিতির আলোকে ভারত সরকার স্বীকৃতি অনুমোদনের সিদ্ধান্ত গ্রহণ করেছে। আমি একটি অনুলিপি সংযুক্ত করছি। আপনার বিশ্বস্ত ইন্দিরা গান্ধী।" ',
'৬ ডিসেম্বর ১৯৭১ দক্ষিণ এশিয়ায় ভুটান সর্বপ্রথম বাংলাদেশকে স্বাধীন ও সার্বভৌম রাষ্ট্র হিসেবে আনুষ্ঠানিকভাবে স্বীকৃতি দান করে। ',
'যুক্তরাষ্ট্রের তৎকালীন রাষ্ট্রপতি রিচার্ড নিক্সন মুক্তিযুদ্ধকে পাকিস্তানের অভ্যন্তরীণ ব্যাপার হিসেবে উল্লেখ করে পরিস্থিতি নিয়ন্ত্রণে আনতে তাদের কিছুই করার নেই বলে অভিমত প্রকাশ করেন। ১৯৭১ সালে আমেরিকা যুক্তরাষ্ট্র ছিল পাকিস্তানের প্রধানতম মিত্র এবং যুদ্ধ চলাকালীন যুক্তরাষ্ট্র পাকিস্তানকে রাজনৈতিক ও বস্তুগত - উভয়ভাবেই সহায়তা করে। সেন্ট্রাল ইন্টেলিজেন্সের পরিচালক রিচার্ড হেল্মস নিক্সনকে ভুল তথ্য দিয়েছিল যে, ইন্দিরা গান্ধীর উদ্দেশ্য হল যুদ্ধে পাকিস্তান সেনাবাহিনীকে ধ্বংস করা ও কাশ্মীরকে দখল করা। এই ভুল খবরকে অত্যন্ত গুরুত্বের সঙ্গে বিবেচনা করে পাকিস্তানের পরাজয় আশঙ্কা করতে পেরে নিক্সন যুক্তরাষ্ট্র থেকে সপ্তম নৌবহর টাস্ক ফোর্স ৭৪কে রনতরী ইউএসএস এন্টারপ্রাইজের মাধ্যমে বঙ্গোপসাগরে মোতায়ন করে, যা ভারতীয়রা নিউক্লিয়ার যুদ্ধ শুরু করার হুমকি হিসেবে উল্লেখ করে। রনতরীটি ১৯৭১ সালের ১১ ডিসেম্বর গন্তব্যে পৌঁছায়। যুক্তরাষ্ট্রের এই হুমকির জবাব হিসেবে সোভিয়েত নৌবাহিনী ৬ ও ১৩ ডিসেম্বর নিউক্লিয়ার মিসাইলবাহী দুটি ডুবোজাহাজ ভ্লাডিভোস্টক থেকে বঙ্গোপসাগরে প্রেরণ করে; যারা ইউএস টাস্ক ফোর্স ৭৪কে ১৮ ডিসেম্বর থেকে ৭ জানুয়ারি ১৯৭২ পর্যন্ত ভারত মহাসাগরে তাড়া করে বেড়ায়। আমেরিকা যুক্তরাষ্ট্র ১২ ডিসেম্বর নিরাপত্তা পরিষদের আরেকটি অধিবেশনের আহ্বান জানায়। তবে এ অধিবেশন অনুষ্ঠিত হতে হতে এবং এতে কোনো সিদ্ধান্ত গৃহীত হওয়ার আগেই যুদ্ধ শেষ হয়ে যায়, যার ফলে এ অধিবেশনের কেতাবি গুরুত্ব ছাড়া আর কোনো অর্থ ছিলনা। ১৯৭১-এর শেষভাগে সোভিয়েত রাশিয়ার সমর্থন নিশ্চিত হওয়ার পর সোভিয়েত ইউনিয়ন বাংলাদেশকে সমর্থন প্রদান করে এবং মুক্তিবাহিনী ও ভারতীয় সামরিক বাহিনীকে সাহায্য করে। সোভিয়েতের উদ্দেশ্য ছিল বাংলাদেশ স্বাধীনতা লাভ করলে তার প্রতিপক্ষ আমেরিকা ও চীনকে হীনবল করবে। সোভিয়েত রাশিয়া ভারতকে আশ্বাস দেয় যে, যুক্তরাষ্ট্র বা চীন যুদ্ধে সম্পৃক্ত হলে তারা এর বিরুদ্ধে উপযুক্ত ব্যবস্থা গ্রহণ করবে। এই আলোকেই ১৯৭১-এর আগস্টে ইন্দো-সোভিয়েত চুক্তি সম্পাদিত হয়। ',
'পাকিস্তানের পুরোনো বন্ধু চীন কৌশলগত কারণে যুদ্ধবিরতির জন্যে চাপ প্রয়োগ করেছিল। অন্যদিকে দীর্ঘ আলোচনার পর ৭ ডিসেম্বর জাতিসংঘ সাধারণ পরিষদ সংখ্যাগরিষ্ঠের মতানুযায়ী সিদ্ধান্ত নিয়ে আহ্বান জানায় অবিলম্বে যুদ্ধবিরতি ও সৈন্য প্রত্যাহার করতে হবে। \n \nপাকিস্তানের দীর্ঘদিনের মিত্র হিসাবে গণপ্রজাতন্ত্রী চীন পূর্ব পাকিস্তানের ক্রমবর্ধমান পরিস্থিতি এবং পশ্চিম পাকিস্তান এবং পাকিস্তান-নিয়ন্ত্রিত কাশ্মীরে ভারতের আগ্রাসনের বিষয়ে উদ্বেগ প্রকাশ করেছিল। ১৯৭১ সালের ১০ই ডিসেম্বর মার্কিন প্রেসিডেন্ট নিক্সন হেনরি কিসিঞ্জারকে নির্দেশ দিয়েছিলেন যে, সে যেন চীনকে ভারতের সাথে তাদের সীমান্তের দিকে কিছু সেনা মোতায়েন করতে বলে। নিক্সন বলেছিলেন, "তাদের বাহিনী স্থানান্তর করতে বা সরিয়ে নিতে হুমকি দাও, হেনরি, এটি এখন তাদেরকে অবশ্যই করতে হবে।" কিসিঞ্জার তার পরপরই সেদিন সন্ধ্যায় জাতিসংঘে চীনের স্থায়ী প্রতিনিধি হুয়াং হুয়ার সাথে সাক্ষাত করেন।  চীন অবশ্য এই আহ্বানে সাড়া দেয়নি, কারণ ১৯৬২ সালের চীন-ভারত যুদ্ধের যখন ভারত পুরোপুরি অপ্রস্তুত অবস্থায় ধরাশায়ী হয়েছিল, তার বিপরীতে এবার ভারতীয় সেনাবাহিনী পুরোপুরি প্রস্তুত ছিল এবং আগের মত ঘটনা যেন পুনরায় না ঘটে সেজন্য চীন-ভারত সীমান্তে আটটি মাউন্টেন ডিভিশন মোতায়েন করেছিল। একারণে সেনা মোতায়েনের পরিবর্তে চীন অবিলম্বে যুদ্ধবিরতির দাবি করে চাপ প্রয়োগ করতে থাকে। \n \n১৯৭২ সালে বাংলাদেশ জাতিসংঘের সদস্যপদের জন্য আবেদন করলে চীন তাদের আবেদনে ভেটো দেয়,  কারণ যুদ্ধাপরাধী পাকিস্তানি বন্দীদের এবং বেসামরিক নাগরিকদের প্রত্যাবাসন সম্পর্কে জাতিসংঘের দুটি প্রস্তাব তখনও কার্যকর হয়নি।  সকল দেশের মধ্যে চীন সবার শেষে ১৯৭৫ সালের ৩১শে আগস্ট স্বাধীন বাংলাদেশকে স্বীকৃতি দিয়েছিল, এর আগপর্যন্ত পর্যন্ত তারা তা করতে অস্বীকৃতি জানিয়ে আসছিল। ',
'সেসময় পাকিস্তান ও শ্রীলঙ্কা পরস্পর মিত্র হওয়ার কারণে স্বাধীনতা যুদ্ধে শ্রীলঙ্কা পাকিস্তানকে সমর্থন করেছিল। পাকিস্তানি যুদ্ধবিমান তখন ভারতের আকাশসীমায় উড্ডয়ন করতে পারতনা, তাই তারা ভারতের পাশ দিয়ে অপেক্ষাকৃত দীর্ঘ যাত্রাপথে ভ্রমণ করত এবং শ্রীলঙ্কার বন্দরনায়েকে বিমানবন্দরে যাত্রাবিরতি করে সেখান থেকে বিমানের জ্বালানি পূর্ণ করে নিয়ে পূর্ব পাকিস্তান বা তৎকালীন বাংলাদেশের উদ্দেশ্যে রওয়ানা দিত।',
'অন্যান্য আরব দেশসমূহ যুক্তরাষ্ট্র ও পাকিস্তানের সঙ্গে মিত্রতার সম্পর্কে ছিল, আর কিসিঞ্জারের জন্য তাদেরকে নিজেদের সমর্থন দিতে উৎসাহিত করাও সহজ ছিল। তিনি জর্ডানের বাদশাহ ও সৌদি আরবের বাদশাহ উভয়ের কাছেই পত্র প্রেরণ করেন। মার্কিন রাষ্ট্রপতি নিক্সন জর্ডানকে দশটি এফ-১০৪ যুদ্ধবিমান পাঠানোর অনুমতি দেন এবং তার পরিবর্তে প্রতিদান দেওয়ার প্রতিশ্রুতি দেন।  লেখক মারটিন বোম্যানের মতে, "লিবিয়ার এফ-ফাইভ বিমানগুলো সারগোধা বিমানঘাঁটিতে মোতায়েন করা হয়, যেন পাকিস্তানি বিমানচালকদের গড়ে তোলার জন্য একে মানসম্মত প্রশিক্ষণ ইউনিট হিসেবে ব্যবহার করা যায় এবং পরবর্তীতে সম্ভাব্য চাহিদা মোতাবেক সৌদি আরব থেকে একাধারে আরও এফ-৫ বিমান সরবরাহ করা যায়।" লিবীয় স্বৈরশাসক গাদ্দাফিও ভারতীয় প্রধানমন্ত্রী ইন্দিরা গান্ধীর কাছে ব্যক্তিগতভাবে একটি কঠিন ভাষায় লিখিত পত্র প্রেরণ করেন, যাতে তিনি ইন্দিরাকে পাকিস্তানের বিরুদ্ধে আগ্রাসন চালানোর অভিযোগে অভিযুক্ত করেন, যার ফলশ্রুতিতে তিনি সেসময় পাকিস্তানিদের প্রিয়পাত্র হয়ে ওঠেন। এই তিন দেশের পাশাপাশি, একটি অচিহ্নিত মধ্যপ্রাচ্যীয় মিত্র দেশও পাকিস্তানকে মিরেজ ৩ যুদ্ধবিমান সরবরাহ করে। তবে, সিরিয়া ও তিউনিসিয়ার মত অন্য দেশগুলো একে পাকিস্তানের আভ্যন্তরীণ বিষয় বলে বিবৃতি দিয়ে এতে হস্তক্ষেপ করার বিরুদ্ধে অবস্থান নেয়।',
'যুদ্ধের সময়, ইরানও রাজনৈতিক ও কূটনৈতিকভাবে পাকিস্তানের পাশে দাঁড়িয়েছিল। দেশটি পাকিস্তানের সম্ভাব্য ভাঙ্গন নিয়ে চিন্তিত ছিল, তারা ভয় পাচ্ছিল যে, যুদ্ধের ফলে দেশটি ছোট ছোট খণ্ডে বিভক্ত হয়ে যাবে, যার ফলে ইরান চারদিক থেকে শত্রুবেষ্টিত হয়ে পড়বে। যুদ্ধের শুরুর দিকে, ইরান পাকিস্তানকে যুদ্ধে পিএএফ-এর ফাইটার জেটসমূহের জন্য আশ্রয় দিয়ে এবং বিনামূল্যে জ্বালানি সরবরাহ করে সাহায্য করে, যেন পাকিস্তানের আঞ্চলিক অখণ্ডতা অটুট থাকে। যখন পাকিস্তান একতরফা যুদ্ধবিরতি ঘোষণা করে এবং আত্মসমর্পণের ঘোষণা দেয়, তখন ইরানের শাহ অনতিবিলম্বে ইরানের সেনাবাহিনীকে প্রস্তুত করেন যেন তারা পূর্ব পরিকল্পনা অনুযায়ী পূর্বপ্রস্তুতি নিয়ে রাখে, যাতে জোরপূর্বক পাকিস্তানকে আক্রমণ করে পাকিস্তানের বেলুচিস্তান প্রদেশ অংশকে কেউ আগেভাগে দখল করে ফেলার আগেই যেভাবেই হোক ইরানের বেলুচিস্তান প্রদেশের অংশে যেন যুক্ত করা যায়। '
];