import 'package:bijoy/helper/castom_appbar.dart';
import 'package:bijoy/screen/vactory/vactory_details.dart';
import 'package:flutter/material.dart';

class VactoryHome extends StatefulWidget {
  const VactoryHome({Key? key}) : super(key: key);

  @override
  _VactoryHomeState createState() => _VactoryHomeState();
}

class _VactoryHomeState extends State<VactoryHome> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: PreferredSize(
          preferredSize: Size.fromHeight(60),
          child: CustomAppBar(titile: 'বিজয় দিবস')
      ),
      body: Padding(
        padding: const EdgeInsets.all(28.0),
        child: Column(
          children: [
            Expanded(
              child: ListView.builder(
                itemCount: bijoyTitleList.length,
                  itemBuilder: (context,index){
                    return Padding(
                      padding: const EdgeInsets.all(8.0),
                      child: SizedBox(
                        height: 60,
                        child: ElevatedButton(
                          child: Text(bijoyTitleList[index],
                            style: TextStyle(
                                fontSize: 20
                            ),
                          ),
                          style: ElevatedButton.styleFrom(
                              primary: Colors.teal
                          ),
                          onPressed: (){
                            Navigator.push(context,
                                MaterialPageRoute(builder: (context)=>VactoryDetails(
                                    bijoyTitle: bijoyTitleList[index],
                                    bijoyDetails: bijoyDetailsList[index])));
                          },
                        ),
                      ),
                    );
                  }),
            )
          ],
        ),
      ),
    );
  }
}
List <String> bijoyTitleList = [
"বিজয় দিবস",
"পাকবাহিনীর আত্মসমর্পণ",
"বাংলাদেশের স্বীকৃতি",
"বিজয় দিবস উৎযাপন",
  "বিজয় দিবসের বিশেষ কিছু ঘটনা"
];
List <String> bijoyDetailsList = [
"বাংলাদেশে বিশেষ দিন হিসেবে রাষ্ট্রীয়ভাবে দেশের সর্বত্র পালন করা হয়। প্রতি বছর ১৬ ডিসেম্বর বাংলাদেশে দিনটি বিশেষভাবে পালিত হয়। ১৯৭২ সালের ২২ জানুয়ারি প্রকাশিত এক প্রজ্ঞাপনে এই দিনটিকে বাংলাদেশে জাতীয় দিবস হিসেবে উদ্যাপন করা হয় এবং সরকারীভাবে এ দিনটিতে ছুটি ঘোষণা করা হয়।৯ মাস যুদ্ধের পর ১৯৭১ সালের ১৬ ডিসেম্বর ঢাকার সোহরাওয়ার্দী উদ্যানে পাকিস্তানি বাহিনীর প্রায় ৯১,৬৩৪ সদস্য বাংলাদেশ ও ভারতের সমন্বয়ে গঠিত যৌথবাহিনীর কাছে আনুষ্ঠানিকভাবে আত্মসমর্পণ করে।এর ফলে পৃথিবীর বুকে বাংলাদেশ নামে একটি নতুন স্বাধীন ও সার্বভৌম রাষ্ট্রের অভ্যুদয় ঘটে। ভারতেও এই দিনটি বিজয় দিবস হিসেবে পালিত হয়ে থাকে। \n \nএ উপলক্ষে প্রতি বছর বাংলাদেশে দিবসটি যথাযথ ভাবগাম্ভীর্য এবং বিপুল উৎসাহ-উদ্দীপনার সাথে পালিত হয়। ১৬ ডিসেম্বর ভোরে ৩১ বার তোপধ্বনির মাধ্যমে দিবসের সূচনা ঘটে। জাতীয় প্যারেড স্কয়ারে অনুষ্ঠিত সম্মিলিত সামরিক কুচকাওয়াজে বাংলাদেশ সেনাবাহিনী, বাংলাদেশ নৌবাহিনী এবং বাংলাদেশ বিমানবাহিনীর সদস্যরা যোগ দেন। কুচকাওয়াজের অংশ হিসেবে সালাম গ্রহণ করেন দেশটির প্রধান রাষ্ট্রপতি কিংবা প্রধানমন্ত্রী। এই কুচকাওয়াজ দেখার জন্য প্রচুরসংখ্যক মানুষ জড়ো হয়। \n \nবাংলাদেশের স্বাধীনতা যুদ্ধে যারা নিহত হয়েছেন তাদের প্রতি শ্রদ্ধা নিবেদনের অংশ হিসেবে ঢাকার সাভারে অবস্থিত জাতীয় স্মৃতিসৌধে রাষ্ট্রপতি, প্রধানমন্ত্রী, বিরোধী দলীয় নেতা-কর্মী, বিভিন্ন সামাজিক ও সাংস্কৃতিক সংগঠনসহ সর্বস্তরের মানুষ পুষ্পস্তবক অর্পণ করে থাকেন। ",
"১৯৭১ খ্রিস্টাব্দে নয় মাসের রক্তক্ষয়ী যুদ্ধের পর পাকিস্তানি বাহিনী এই দিনে যৌথবাহিনীর কাছে আত্মসমর্পণ করতে বাধ্য হয়েছিল। সেদিন ঢাকার কেন্দ্রস্থলে রেসকোর্স ময়দানে পাকিস্তানের পক্ষে আত্মসমর্পণের দলিলে স্বাক্ষর করেন জেনারেল আমির আবদুল্লাহ খান নিয়াজি। তিনি যৌথবাহিনীর প্রধান জেনারেল জগজিৎ সিং অরোরার কাছে আত্মসমর্পণ করেন। এই আত্মসমর্পণ অনুষ্ঠানে বাংলাদেশের মুক্তিবাহিনীর উপ-সর্বাধিনায়ক ও ডেপুটি চীফ অব স্টাফ গ্রুপ ক্যাপ্টেন আবদুল করিম খোন্দকার উপস্থিত ছিলেন। তবে মুক্তিযুদ্ধের সর্বাধিনায়ক জেনারেল ওসমানী উপস্থিত ছিলেন না। আত্মসমর্পণ দলিলের ভাষ্য ছিল নিম্নরূপ: \n \nপূর্ব রণাঙ্গনে ভারতীয় ও বাংলাদেশ বাহিনীর জেনারেল অফিসার কমান্ডিং ইন চিফ, লেফটেন্যান্ট-জেনারেল জগজিৎ সিং অরোরার কাছে পাকিস্তান পূর্বাঞ্চলীয় সামরিক কমান্ড বাংলাদেশে অবস্থানরত পাকিস্তানের সকল সশস্ত্র বাহিনী নিয়ে আত্মসমর্পণে সম্মত হলো। পাকিস্তানের সেনা, নৌ ও বিমানবাহিনীসহ সব আধা-সামরিক ও বেসামরিক সশস্ত্র বাহিনীর ক্ষেত্রে এই আত্মসমর্পণ প্রযোজ্য হবে। এই বাহিনীগুলো যে যেখানে আছে, সেখান থেকে লেফটেন্যান্ট জেনারেল জগজিৎ সিং অরোরার কর্তৃত্বাধীন নিয়মিত সবচেয়ে নিকটস্থ সেনাদের কাছে অস্ত্রসমর্পণ ও আত্মসমর্পণ করবে। \n \nএই দলিল স্বাক্ষরের সঙ্গে সঙ্গে পাকিস্তানের পূর্বাঞ্চলীয় সামরিক কমান্ড লেফটেন্যান্ট-জেনারেল অরোরার নির্দেশের অধীন হবে। নির্দেশ না মানলে তা আত্মসমর্পণের শর্তের লঙ্ঘন বলে গণ্য হবে এবং তার প্রেক্ষিতে যুদ্ধের স্বীকৃত আইন ও রীতি অনুযায়ী ব্যবস্থা নেওয়া হবে। আত্মসমর্পণের শর্তাবলীর অর্থ অথবা ব্যাখ্যা নিয়ে কোনো সংশয় দেখা দিলে, লেফটেন্যান্ট-জেনারেল জগজিৎ সিং অরোরার সিদ্ধান্তই হবে চূড়ান্ত। \n \nলেফটেন্যান্ট-জেনারেল জগজিৎ সিং অরোরা আত্মসমর্পণকারী সেনাদের জেনেভা কনভেনশনের বিধি অনুযায়ী প্রাপ্য মর্যাদা ও সম্মান দেওয়ার প্রত্যয় ঘোষণা করছেন এবং আত্মসমর্পণকারী পাকিস্তানি সামরিক ও আধা-সামরিক ব্যক্তিদের নিরাপত্তা ও সুবিধার অঙ্গীকার করছেন। লেফটেন্যান্ট-জেনারেল জগজিৎ সিং অরোরার অধীন বাহিনীগুলোর মাধ্যমে বিদেশি নাগরিক, সংখ্যালঘু জাতিসত্তা ও জন্মসূত্রে পশ্চিম পাকিস্তানি ব্যক্তিদের সুরক্ষাও দেওয়া হবে।",
"পাকিস্তান সেনাবাহিনীর আত্মসমর্পণের মাধ্যমে ৯ মাস ব্যাপী স্বাধীনতা যুদ্ধের সমাপ্তি ঘটে এবং বাংলাদেশ নামের একটি স্বাধীন রাষ্ট্রের সৃষ্টি হয়। জাতিসংঘের অন্তর্ভুক্ত প্রায় সকল দেশ স্বাধীনতার মাসে বাংলাদেশকে স্বীকৃতি দেয়।",
"১৯৭২ সাল থেকে বাংলাদেশে বিজয় দিবস রাষ্ট্রীয়ভাবে পালন করা হয় । বাংলাদেশের স্বাধীনতা যুদ্ধ জাতির জন্য একটি গুরুত্বপূর্ণ ঘটনা, চলচ্চিত্র, কবিতা, নিবন্ধ, গণমাধ্যম ইত্যাদি বিভিন্নভাবে এই বিষয়টি ফুটিয়ে তোলা হয়। এই দিন উপলক্ষে বাংলাদেশের সামরিক বাহিনী জাতীয় প্যারেড স্কয়ারে বিজয় দিবসের কুচকাওয়াজের আয়োজন করে থাকে, এছাড়া দেশের প্রতিটি উপজেলায় বিজয় দিবসের কুচকাওয়াজ,বিশেষ আলোচনা অনুষ্ঠান, মতবিনিময় সভা,সাংস্কৃতিক অনুষ্ঠানেরও আয়োজন করা হয়। দেশের প্রধান সড়কগুলো জাতীয় পতাকা দিয়ে সাজানো হয়। এই দিনে ঢাকার সাভারে জাতীয় স্মৃতিসৌধে বিশেষ সম্মান প্রদর্শন করা হয়। \n \n আলোকসজ্জা দ্বারা সংসদ ভবন আলোকিত করা হয় এই দিবসে।\n \nবাংলাদেশের স্বাধীনতা দিবস বেশ বর্ণাঢ্য ভাবে উদ্যাপন করা হয়। জাতীয় স্মৃতিসৌধে পুষ্পস্তবক অর্পণের মাধ্যমে উদ্যাপন শুরু হয়। ৩১ বার তোপধ্বনির মধ্য দিয়ে দিবসের শুভ সূচনা করা হয়। সূর্যোদয়ের সঙ্গে সঙ্গে সরকারি, আধা-সরকারি, স্বায়ত্তশাসিত এবং ব্যক্তিমালিকানাধীন ভবনসমূহে জাতীয় পতাকা উত্তোলন করা হয়। দিবসটি উপলক্ষে সকাল থেকে রাত পর্যন্ত শহরের প্রধান প্রধান সড়ক ও সড়কদ্বীপসমূহ জাতীয় পতাকা ও বিভিন্ন রঙের পতাকা দিয়ে সজ্জিত করা হয়। জাতীয় স্টেডিয়ামে শিক্ষা প্রতিষ্ঠানের ছাত্রছাত্রীদের সমাবেশ, কুচকাওয়াজ, ডিসপ্লে ও শরীরচর্চা প্রদর্শন করা হয়। \n \nএই দিনটিতে সরকারি ছুটি থাকে। পত্রিকাগুলো বিশেষ ক্রোড়পত্র বের করে। বেতার ও টিভি চ্যানেলগুলো বিশেষ অনুষ্ঠান প্রচার করে।",
"১৯৭১: স্টেট ব্যাংক অব পাকিস্তানের নামকরণ করা হয় বাংলাদেশ ব্যাংক।\n \n১৯৭২: গণপ্রজাতন্ত্রী বাংলাদেশ সরকারের প্রথম সংবিধান প্রকাশিত হয়।\n \n১৯৭২: ১৫ ডিসেম্বর বাংলাদেশ গ্যাজেটের মাধ্যমে স্বাধীনতা যুদ্ধে বিশেষ অবদানের জন্য রাষ্ট্রীয় খেতাব ঘোষণা করা হয়। \n \n১৯৯৬: ২৫ বছর পূর্তি উৎসব করা হয়।\n \n২০১৩: জাতীয় প্যারেড গ্রাউন্ডে ২৭,১১৭ জন স্বেচ্ছাসেবী বাংলাদেশের জাতীয় পতাকার লাল এবং সবুজ ব্লক নিয়ে একত্রে জড়ো হয়ে বিশ্বের বৃহত্তম মানব পতাকার নতুন বিশ্ব রেকর্ড করে।\n \n২০২১ : ৫০ বছর পূর্তি উতসব পালন করা হয়।"
];